# FamilySizeTableErrorInfo Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableErrorInfo Class
Members See Also
---
Error information generated from the CSV file import of a FamilySizeTable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class FamilySizeTableErrorInfo : IDisposable
```

Visual Basic
---
```text
Public Class FamilySizeTableErrorInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FamilySizeTableErrorInfo : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FamilySizeTableErrorInfo
# See Also
FamilySizeTableErrorInfo Members
Autodesk.Revit.DB Namespace